In [24]:
import pandas as pd

In [89]:

TOP10_UNIVERITIES = {"UNIVERSITY":["Harvard University","Massachusetts Institute of Technology","California Institute of Technology","University of California"],
            "CITY":["Cambridge","Cambridge","Pasadena","Berkeley"],
       "PROVINCE":["MA","MA","CA","CA"],
           "STATUS":["Private","Private","Private","Public"],
                    "YEAR":[1960,1980,1930,1955],
                    "GLOBALSCORE":[100.0,97.7,88.7,86.8]}
universityData = pd.DataFrame(TOP10_UNIVERITIES)
print(universityData)

                              UNIVERSITY       CITY PROVINCE   STATUS  YEAR  \
0                     Harvard University  Cambridge       MA  Private  1960
1  Massachusetts Institute of Technology  Cambridge       MA  Private  1980
2     California Institute of Technology   Pasadena       CA  Private  1930
3               University of California   Berkeley       CA   Public  1955

   GLOBALSCORE
0        100.0
1         97.7
2         88.7
3         86.8

In [90]:
head = universityData.head()
print(head)

                              UNIVERSITY       CITY PROVINCE   STATUS  YEAR  \
0                     Harvard University  Cambridge       MA  Private  1960
1  Massachusetts Institute of Technology  Cambridge       MA  Private  1980
2     California Institute of Technology   Pasadena       CA  Private  1930
3               University of California   Berkeley       CA   Public  1955

   GLOBALSCORE
0        100.0
1         97.7
2         88.7
3         86.8

In [91]:
print(universityData.columns)

Index(['UNIVERSITY', 'CITY', 'PROVINCE', 'STATUS', 'YEAR', 'GLOBALSCORE'], dtype='object')

In [92]:
print(universityData.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   UNIVERSITY   4 non-null      object
 1   CITY         4 non-null      object
 2   PROVINCE     4 non-null      object
 3   STATUS       4 non-null      object
 4   YEAR         4 non-null      int64
 5   GLOBALSCORE  4 non-null      float64
dtypes: float64(1), int64(1), object(4)
memory usage: 320.0+ bytes
None

In [93]:
print(universityData.dtypes)

UNIVERSITY      object
CITY            object
PROVINCE        object
STATUS          object
YEAR             int64
GLOBALSCORE    float64
dtype: object

In [94]:
print(universityData.describe())

              YEAR  GLOBALSCORE
count     4.000000     4.000000
mean   1956.250000    93.300000
std      20.564938     6.523292
min    1930.000000    86.800000
25%    1948.750000    88.225000
50%    1957.500000    93.200000
75%    1965.000000    98.275000
max    1980.000000   100.000000

In [95]:
print(universityData["UNIVERSITY"])

0                       Harvard University
1    Massachusetts Institute of Technology
2       California Institute of Technology
3                 University of California
Name: UNIVERSITY, dtype: object

In [96]:
print(universityData["CITY"])

0    Cambridge
1    Cambridge
2     Pasadena
3     Berkeley
Name: CITY, dtype: object

In [97]:
print(universityData.loc[:,"PROVINCE"])

0    MA
1    MA
2    CA
3    CA
Name: PROVINCE, dtype: object

In [98]:
print(universityData)

                              UNIVERSITY       CITY PROVINCE   STATUS  YEAR  \
0                     Harvard University  Cambridge       MA  Private  1960
1  Massachusetts Institute of Technology  Cambridge       MA  Private  1980
2     California Institute of Technology   Pasadena       CA  Private  1930
3               University of California   Berkeley       CA   Public  1955

   GLOBALSCORE
0        100.0
1         97.7
2         88.7
3         86.8

In [99]:
universityData["YEAR"] =[1990,1932,1899,1850]

In [100]:
print(universityData)

                              UNIVERSITY       CITY PROVINCE   STATUS  YEAR  \
0                     Harvard University  Cambridge       MA  Private  1990
1  Massachusetts Institute of Technology  Cambridge       MA  Private  1932
2     California Institute of Technology   Pasadena       CA  Private  1899
3               University of California   Berkeley       CA   Public  1850

   GLOBALSCORE
0        100.0
1         97.7
2         88.7
3         86.8

In [101]:
print(universityData.loc[1:3,"UNIVERSITY"])

1    Massachusetts Institute of Technology
2       California Institute of Technology
3                 University of California
Name: UNIVERSITY, dtype: object

In [102]:
print(universityData.loc[:3,"STATUS"])

0    Private
1    Private
2    Private
3     Public
Name: STATUS, dtype: object

In [103]:
print(universityData.loc[::-1])

                              UNIVERSITY       CITY PROVINCE   STATUS  YEAR  \
3               University of California   Berkeley       CA   Public  1850
2     California Institute of Technology   Pasadena       CA  Private  1899
1  Massachusetts Institute of Technology  Cambridge       MA  Private  1932
0                     Harvard University  Cambridge       MA  Private  1990

   GLOBALSCORE
3         86.8
2         88.7
1         97.7
0        100.0

In [104]:
universityFilter= universityData.YEAR>1890
universityData["BOOL"]=universityFilter
print(universityData.loc[:,["YEAR","BOOL"]])

   YEAR   BOOL
0  1990   True
1  1932   True
2  1899   True
3  1850  False

In [105]:
print(universityData)

                              UNIVERSITY       CITY PROVINCE   STATUS  YEAR  \
0                     Harvard University  Cambridge       MA  Private  1990
1  Massachusetts Institute of Technology  Cambridge       MA  Private  1932
2     California Institute of Technology   Pasadena       CA  Private  1899
3               University of California   Berkeley       CA   Public  1850

   GLOBALSCORE   BOOL
0        100.0   True
1         97.7   True
2         88.7   True
3         86.8  False

In [106]:
universityFilter2 = universityData.GLOBALSCORE<90
Filtered=universityData[universityFilter&universityFilter2]
print(Filtered)

                           UNIVERSITY      CITY PROVINCE   STATUS  YEAR  \
2  California Institute of Technology  Pasadena       CA  Private  1899

   GLOBALSCORE  BOOL
2         88.7  True

In [107]:
universityData.dropna(inplace=True)
universityData

,UNIVERSITY,CITY,PROVINCE,STATUS,YEAR,GLOBALSCORE,BOOL
0,Harvard University,Cambridge,MA,Private,1990,100.0,True
1,Massachusetts Institute of Technology,Cambridge,MA,Private,1932,97.7,True
2,California Institute of Technology,Pasadena,CA,Private,1899,88.7,True
3,University of California,Berkeley,CA,Public,1850,86.8,False

In [108]:
universityData["PROGRAM"]=["face to face" if universityData.YEAR.mean()>each else "Online" for each in universityData.YEAR]
universityData

,UNIVERSITY,CITY,PROVINCE,STATUS,YEAR,GLOBALSCORE,BOOL,PROGRAM
0,Harvard University,Cambridge,MA,Private,1990,100.0,True,Online
1,Massachusetts Institute of Technology,Cambridge,MA,Private,1932,97.7,True,Online
2,California Institute of Technology,Pasadena,CA,Private,1899,88.7,True,face to face
3,University of California,Berkeley,CA,Public,1850,86.8,False,face to face

In [109]:
universityData.columns = [each.split('_')[0]+ " "+ each.split('_')[1] if len(each.split('_'))>1 else each for each in universityData.columns]
universityData

,UNIVERSITY,CITY,PROVINCE,STATUS,YEAR,GLOBALSCORE,BOOL,PROGRAM
0,Harvard University,Cambridge,MA,Private,1990,100.0,True,Online
1,Massachusetts Institute of Technology,Cambridge,MA,Private,1932,97.7,True,Online
2,California Institute of Technology,Pasadena,CA,Private,1899,88.7,True,face to face
3,University of California,Berkeley,CA,Public,1850,86.8,False,face to face

In [110]:
universityData.columns=[each.lower() for each in universityData.columns]
universityData.columns

Index(['university', 'city', 'province', 'status', 'year', 'globalscore',
       'bool', 'program'],
      dtype='object')

In [113]:
universityData.columns=[each.upper() for each in universityData.columns]
universityData.columns

Index(['UNIVERSITY', 'CITY', 'PROVINCE', 'STATUS', 'YEAR', 'GLOBALSCORE',
       'BOOL', 'PROGRAM'],
      dtype='object')

In [114]:
Data1=universityData.head()
Data2=universityData.tail()
connect=pd.concat([Data1,Data2],axis=0)
connect

,UNIVERSITY,CITY,PROVINCE,STATUS,YEAR,GLOBALSCORE,BOOL,PROGRAM
0,Harvard University,Cambridge,MA,Private,1990,100.0,True,Online
1,Massachusetts Institute of Technology,Cambridge,MA,Private,1932,97.7,True,Online
2,California Institute of Technology,Pasadena,CA,Private,1899,88.7,True,face to face
3,University of California,Berkeley,CA,Public,1850,86.8,False,face to face
0,Harvard University,Cambridge,MA,Private,1990,100.0,True,Online
1,Massachusetts Institute of Technology,Cambridge,MA,Private,1932,97.7,True,Online
2,California Institute of Technology,Pasadena,CA,Private,1899,88.7,True,face to face
3,University of California,Berkeley,CA,Public,1850,86.8,False,face to face

In [123]:
universityData["ENROLLMENT"]= [(each*8.5)/10 for each in universityData.GLOBALSCORE]
universityData

,UNIVERSITY,CITY,PROVINCE,STATUS,YEAR,GLOBALSCORE,BOOL,PROGRAM,ENROLLMENT
0,Harvard University,Cambridge,MA,Private,1990,100.0,True,Online,85.000
1,Massachusetts Institute of Technology,Cambridge,MA,Private,1932,97.7,True,Online,83.045
2,California Institute of Technology,Pasadena,CA,Private,1899,88.7,True,face to face,75.395
3,University of California,Berkeley,CA,Public,1850,86.8,False,face to face,73.780